<?php

$d1 = 3 + 5; 
$d2 = 3 - 5; 
$d3 = 3 * 5; 
$d4 = 3 / 5; 
$d5 = 3 % 5; 
$d6 = 3 ** 5; 
$d7 = "Web" . "プログラミング"; 
$d8 = "<p>"; 
$d8 .= "文字です</p>";

echo("{$d1}のデータ型は，「" . gettype($d1) . "」です<br>"); 
echo("{$d2}のデータ型は，「" . gettype($d2) . "」です<br>"); 
echo("{$d3}のデータ型は，「" . gettype($d3) . "」です<br>"); 
echo("{$d4}のデータ型は，「" . gettype($d4) . "」です<br>"); 
echo("{$d5}のデータ型は，「" . gettype($d5) . "」です<br>"); 
echo("{$d6}のデータ型は，「" . gettype($d6) . "」です<br>"); 
echo("{$d7}のデータ型は，「" . gettype($d7) . "」です<br>"); 
echo("{$d8}のデータ型は，「" . gettype($d8) . "」です<br>");

?>